Revit 2027 API
ParameterTypeId.StructuralConnectionSymbol Property
 "Connection Symbol"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralConnectionSymbol { get; }
Public Shared ReadOnly Property StructuralConnectionSymbol As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralConnectionSymbol {
	ForgeTypeId^ get ();
}
static member StructuralConnectionSymbol : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace